cases/case01_straight_channel/0/k
FoamFile
{
    version 2.0; format ascii; class volScalarField; location "0"; object k;
}
dimensions   [0 2 -2 0 0 0 0];
internalField uniform 1e-3;

boundaryField
{
    inlet  { type fixedValue;       value uniform 1e-3; }
    outlet { type zeroGradient; }
    wall   { type kqRWallFunction;  value uniform 1e-3; }
}
