cases/case01_straight_channel/0/omega
FoamFile
{
    version 2.0; format ascii; class volScalarField; location "0"; object omega;
}
dimensions   [0 0 -1 0 0 0 0];
internalField uniform 100;

boundaryField
{
    inlet  { type fixedValue;          value uniform 100; }
    outlet { type zeroGradient; }
    wall   { type omegaWallFunction;   value uniform 100; }
}
