cases/case01_straight_channel/0/p
FoamFile
{
    version 2.0; format ascii; class volScalarField; location "0"; object p;
}
dimensions   [1 -1 -2 0 0 0 0];
internalField uniform 8e6;

boundaryField
{
    inlet  { type calculated; value uniform 8e6; }
    outlet { type calculated; value uniform 7.95e6; }
    wall   { type calculated; value uniform 8e6; }
}
