cases/case01_straight_channel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| Pressure (modified, p_rgh) — buoyantPimpleFoam.                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 8e6;       // 8 MPa — typical compressor inlet

boundaryField
{
    inlet     { type fixedFluxPressure; value uniform 8e6; }
    outlet    { type fixedValue;        value uniform 7.95e6; }
    wall      { type fixedFluxPressure; value uniform 8e6; }
}
// ************************************************************************* //
