cases/case01_straight_channel/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| sCO2 thermophysical properties. Two options:                                |
|                                                                             |
| (A) [recommended for skeleton] use a tabulated lookup generated by          |
|     `python3 src/tools/export_lut.py --output-prefix sco2_lut`              |
|     and reference the resulting `sco2_lut_openfoam.dat` from a custom       |
|     mixture model. See docs/02_phase2_cfd_rom.md § 2.3 Method A.            |
|                                                                             |
| (B) write a dedicated sCO2 thermo class                                     |
|     (docs § 2.3 Method B — advanced).                                       |
|                                                                             |
| The settings below are a placeholder using OpenFOAM's built-in              |
| perfectGas + hConst ideal-gas model. **They are wrong for sCO2 near the     |
| pseudo-critical line** and must be replaced before any production run.      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;     // PLACEHOLDER — replace with sCO2 LUT
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   44.01;          // g/mol — CO2
    }
    thermodynamics
    {
        Cp          5000;           // J/kg·K — illustrative; sCO2 Cp varies wildly
        Hf          0;
    }
    transport
    {
        mu          3e-5;           // Pa·s   — placeholder
        Pr          1.0;            // Prandtl placeholder
    }
}

// ************************************************************************* //
