cases/case01_straight_channel/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| Discretisation schemes for PCHE straight-channel buoyantPimpleFoam run.    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                          none;
    div(phi,U)                       Gauss linearUpwindV grad(U);
    div(phi,K)                       Gauss linear;
    div(phi,h)                       Gauss linearUpwind default;
    div(phi,k)                       Gauss upwind;
    div(phi,omega)                   Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
